[{"id":23331,"chapterId":15788,"title":"Abertura do curso, introdução ao módulo","description":"Vamos iniciar este curso com uma introdução ao módulo 1, onde conheceremos a instrutora virtual Nôva. Exploraremos também o código base do curso e daremos as boas-vindas ao nosso estudo de Python.","moduleNumber":1,"chapterNumber":1,"lessonNumber":1,"file":"vd1_001.mp4","footer":null,"youtube_id":"8B98r6jEY5Q","youtube_title":"[Curso Python 1.1.1] Abertura do curso, introdução ao módulo","video_contents":"Abertura do curso, introdução ao módulo 1, apresentação da instrutora virtual Nôva, apresentação do código base do curso."},{"id":20405,"chapterId":15788,"title":"A simpllicidade do editor Python usado no módulo","description":"Vamos explorar a simplicidade do editor Python utilizado neste módulo. Iremos abordar o funcionamento do editor, aprender como executar scripts de forma eficiente e técnicas para manter seu código limpo e organizado, criando um ambiente de desenvolvimento mais produtivo.","moduleNumber":1,"chapterNumber":1,"lessonNumber":2,"file":"vd1_002.mp4","footer":"Agora é com você! Clique [[[EDITOR]]] e carregue o editor para praticar.","youtube_id":"Oydn65QuEaQ","youtube_title":"[Curso Python 1.1.2] A simpllicidade do editor Python usado no módulo","video_contents":"Funcionamento do editor usado nesse módulo, rodando scripts e limpando o código."},{"id":94208,"chapterId":65096,"title":"Primeiros Passos com o Comando print()","description":"Vamos explorar o comando print(), a porta de entrada essencial para iniciantes em Python. Aprenda a exibir mensagens na tela, utilizando parênteses e aspas de forma correta. Descubra como manipular diferentes tipos de aspas para aprimorar suas saídas de texto.","moduleNumber":1,"chapterNumber":2,"lessonNumber":1,"file":"vd1_101.mp4","footer":"Agora é com você! Clique [[[EDITOR]]] e carregue o editor para praticar.","youtube_id":"CbXEqzKDQxw","youtube_title":"[Curso Python 1.2.1] Primeiros Passos com o Comando print()","video_contents":"O comando print(), a porta de entrada para quem está começando a aprender Python. Ccomo exibir mensagens na tela, usando parênteses e aspas corretamente. Uso de aspas."},{"id":11683,"chapterId":65096,"title":"Textos e Números no print(): Diferenças","description":"Você irá explorar como o Python diferencia textos e números ao utilizar o comando print(). Entenda a interpretação de strings e valores numéricos, além de como combiná-los e formatá-los eficientemente nas saídas do seu programa.","moduleNumber":1,"chapterNumber":2,"lessonNumber":2,"file":"vd1_102.mp4","footer":"Agora é com você! Clique [[[EDITOR]]] e carregue o editor para praticar.","youtube_id":"iA7ZIj1MFII","youtube_title":"[Curso Python 1.2.2] Textos e Números no print(): Diferenças","video_contents":"Como o Python interpreta textos e números ao usar o comando print()."},{"id":88520,"chapterId":65096,"title":"Entendendo os Tipos de Dados","description":"Iremos abordar os tipos de dados em Python, essenciais para uma boa programação. Descubra como strings e números são interpretados, e como evitar erros comuns. Vamos explorar exemplos práticos para solidificar esse conhecimento e escrever códigos eficazes.","moduleNumber":1,"chapterNumber":2,"lessonNumber":3,"file":"vd1_103.mp4","footer":null,"youtube_id":"f60QsmFxu1A","youtube_title":"[Curso Python 1.2.3] Entendendo os Tipos de Dados","video_contents":"É essencial compreender os tipos de dados em Python! Quando escrevemos algo entre aspas (simples ou duplas), o Python interpreta como uma string, ou seja, um texto. Já quando digitamos um valor sem aspas, ele é entendido como um número. Atenção: se você colocar um número entre aspas, ele também será tratado como string! Saber essa diferença é fundamental para evitar erros e escrever códigos que funcionam corretamente. Vamos explorar esses conceitos com exemplos simples e práticos."},{"id":44189,"chapterId":65096,"title":"Fazendo Contas com Python","description":"Iremos explorar as operações matemáticas em Python, incluindo soma, subtração, multiplicação (com *), divisão e potências (com **). Descubra como organizar código com o comando print() e realizar cálculos combinados de forma direta e eficiente. Exemplos práticos guiarão seu aprendizado.","moduleNumber":1,"chapterNumber":2,"lessonNumber":4,"file":"vd1_104.mp4","footer":"Agora é com você! Clique [[[EDITOR]]] e carregue o editor para praticar.","youtube_id":"RPnDVsOaR7I","youtube_title":"[Curso Python 1.2.4] Fazendo Contas com Python","video_contents":"Agora que entendemos como o Python lida com números, vamos nos divertir com as operações matemáticas! É possível somar, subtrair, multiplicar, dividir e até calcular potências com facilidade. Para multiplicar, usamos o asterisco (*). Para potências, usamos dois asteriscos (**). Podemos também escrever o comando print() em outra linha, deixando o código mais organizado. Python permite combinar várias operações numa mesma linha, tornando os cálculos simples e diretos. Vamos explorar tudo isso com exemplos práticos!"},{"id":78844,"chapterId":65096,"title":"Operações com Strings: Soma e Repetição","description":"Nesta aula, exploraremos como as operações de soma (+) e multiplicação (*) podem ser aplicadas a strings. Aprenda a concatenar textos e usar o asterisco para repetir palavras, tornando seu código mais criativo. Descubra também o uso da vírgula no print() para espaçar textos.","moduleNumber":1,"chapterNumber":2,"lessonNumber":5,"file":"vd1_105.mp4","footer":"Agora é com você! Clique [[[EDITOR]]] e carregue o editor para praticar.","youtube_id":"TujcZofp_pE","youtube_title":"[Curso Python 1.2.5] Operações com Strings: Soma e Repetição","video_contents":"Strings não são números, mas também permitem operações! Nesta aula, vamos aprender a usar os sinais de soma (+) e multiplicação (*) com textos. A soma de strings é chamada de concatenação e une duas palavras, como em \"Olá\" + \"Amanda\" que resulta em \"OláAmanda\". Também é possível usar vírgula no print(), o que adiciona um espaço entre as palavras. E o asterisco? Ele serve para repetir a string várias vezes, como em \"Olá\" * 3, que imprime “OláOláOlá”. Com esses recursos, você vai deixar seu código mais criativo e expressivo!"},{"id":52596,"chapterId":65096,"title":"Comentários e Código Mais Claro","description":"Vamos explorar o uso da cerquilha (#) para inserir comentários em Python. Com este símbolo, podemos neutralizar linhas ou explicar o funcionamento do código. Comentários são cruciais para a organização e clareza, especialmente em projetos maiores. Aprenda quando e como utilizá-los de forma eficaz!","moduleNumber":1,"chapterNumber":2,"lessonNumber":6,"file":"vd1_106.mp4","footer":"Agora é com você! Clique [[[EDITOR]]] e carregue o editor para praticar.","youtube_id":"aDUpLGaEoiA","youtube_title":"[Curso Python 1.2.6] Comentários e Código Mais Claro","video_contents":"Nesta aula, vamos aprender a usar a cerquilha (#), também conhecida como “jogo da velha”, para escrever comentários em Python. Quando colocamos esse símbolo no início de uma linha, o Python simplesmente ignora o conteúdo, ele não é executado. Isso é útil para “neutralizar” linhas temporariamente ou explicar o que o código está fazendo. Comentários são essenciais para manter o código organizado e compreensível, especialmente quando ele começa a crescer. Vamos ver exemplos práticos de como e quando usar esse recurso fundamental!"},{"id":41520,"chapterId":88049,"title":"Variáveis e nomes claros","description":"Vamos aprender um conceito essencial: variáveis! Pense nelas como caixas nomeadas que guardam valores. Chamamos uma variável de 'peso' e discutimos a importância de usar nomes claros, como 'weight'. Veremos também erros comuns, como nomes incorretos, e como variáveis organizam e simplificam o código.","moduleNumber":1,"chapterNumber":3,"lessonNumber":1,"file":"vd1_201.mp4","footer":"Agora é com você! Clique [[[EDITOR]]] e carregue o editor para praticar.","youtube_id":"sQ_-R0K619o","youtube_title":"[Curso Python 1.3.1] Variáveis e nomes claros","video_contents":"Vamos aprender um conceito essencial da programação: variáveis! Pense nelas como caixas com nomes, onde podemos guardar valores. No exemplo, criamos a variável peso com um número dentro. Como aprendemos, o nome da variável não deve estar entre aspas, senão vira uma string. É uma boa prática usar nomes em inglês, como weight. Também vamos ver um erro comum: escrever o nome da variável de forma incorreta. Ao corrigir, tudo funciona! Variáveis tornam o código organizado, reutilizável e mais fácil de entender."},{"id":79121,"chapterId":88049,"title":"Operações matemáticas com variáveis","description":"Praticando com variáveis, criaremos uma para peso e outra para altura. Calcularemos o IMC com precisão, armazenando o resultado em uma nova variável. Utilizaremos print() para exibir o valor e round() para arredondá-lo a duas casas decimais. Um ótimo exemplo para dominar o uso de variáveis.","moduleNumber":1,"chapterNumber":3,"lessonNumber":2,"file":"vd1_202.mp4","footer":"Agora é com você! Clique [[[EDITOR]]] e carregue o editor para praticar.","youtube_id":"TxBBtw7SAz0","youtube_title":"[Curso Python 1.3.2] Operações matemáticas com variáveis","video_contents":"Agora vamos usar variáveis de forma prática e divertida! Primeiro, criamos uma variável para o peso e outra para a altura. Depois, usamos essas informações para calcular o IMC (Índice de Massa Corporal) com a fórmula correta e armazenamos o resultado em uma nova variável. Usamos print() para exibir o IMC na tela e, para deixar o resultado mais bonito, aplicamos a função round() e arredondamos para duas casas decimais. E o que é uma função? Ah, isso vem na próxima aula! Por enquanto, aproveite esse exemplo real para consolidar o uso de variáveis."},{"id":29062,"chapterId":88049,"title":"Funções em Python: Como Usar","description":"Vamos explorar as funções em Python, uma ferramenta essencial para organizar e otimizar seu código. Veremos a importância dos nomes e parâmetros e a diferença entre funções que retornam ou não um valor. Com exemplos práticos, você compreenderá como utilizá-las eficazmente no seu dia a dia.","moduleNumber":1,"chapterNumber":3,"lessonNumber":3,"file":"vd1_203.mp4","footer":null,"youtube_id":"foqPgslaKHA","youtube_title":"[Curso Python 1.3.3] Funções em Python: Como Usar","video_contents":"Funções são ferramentas poderosas do Python! Elas ajudam a organizar o código, economizar tempo e aumentar a precisão. Toda função tem um nome (sempre sem espaços) seguido de parênteses com seus parâmetros. É uma boa prática usar nomes em inglês e, quando necessário, usar underscore (_) para separar palavras. Na aula anterior usamos round(valor, casas), uma função que retorna um valor arredondado. Já print() é uma função que exibe algo, mas não retorna nada. Ou seja, funções podem ou não retornar valores, dependendo do que fazem. Vamos entender isso na prática!"},{"id":59315,"chapterId":88049,"title":"Explorando Funções com Números e Strings","description":"Vamos explorar funções com números e strings em Python. Revisitamos round() para um decimal e int() para parte inteira. Em strings: len() conta caracteres, upper() transforma em maiúsculas e lower() em minúsculas. Observaremos o uso do ponto antes das funções. Experimente com a gente!","moduleNumber":1,"chapterNumber":3,"lessonNumber":4,"file":"vd1_204.mp4","footer":"Agora é com você! Clique [[[EDITOR]]] e carregue o editor para praticar.","youtube_id":"7uv28EAMa0o","youtube_title":"[Curso Python 1.3.4] Explorando Funções com Números e Strings","video_contents":"Nesta aula, vamos explorar mais exemplos de funções em Python! Revisitamos a função round(), agora arredondando para uma casa decimal. Em seguida, usamos int() para obter apenas a parte inteira de um número. Também trabalhamos com strings usando funções úteis: len() retorna o número de caracteres; upper() transforma o texto em maiúsculas; e lower() em minúsculas. Repare que essas últimas usam um formato diferente, com um ponto antes do nome da função, um conceito que vamos explicar em breve. Por enquanto, aproveite para experimentar esses novos recursos!"},{"id":52403,"chapterId":88049,"title":"Condicionais em Python: Usando o IF","description":"Agora vamos explorar condicionais, uma base crucial na programação. Com a instrução if, podemos especificar ações condicionais, como calcular o IMC e verificar se está acima de 25 para exibir 'sobrepeso'. Dominar o uso de if é fundamental no seu aprendizado de Python!","moduleNumber":1,"chapterNumber":3,"lessonNumber":5,"file":"vd1_301.mp4","footer":"Agora é com você! Clique [[[EDITOR]]] e carregue o editor para praticar.","youtube_id":"vuwxPQm_kpQ","youtube_title":"[Curso Python 1.3.5] Condicionais em Python: Usando o IF","video_contents":"Agora vamos aprender sobre condicionais, um conceito essencial em programação. Com a instrução if, dizemos ao Python: “SE algo acontecer, FAÇA alguma coisa”. No exemplo, usamos peso e altura para calcular o IMC e adicionamos a condição: se o IMC for maior que 25, exibir “sobrepeso”. Aprender a usar corretamente o if é um passo importante na sua jornada!"},{"id":82170,"chapterId":88049,"title":"If, Else e Elif: Tomando Decisões com o Código","description":"Agora nós vamos explorar o uso de if, else e elif para tomar decisões no código. Com exemplos práticos, como o cálculo do IMC, você aprenderá a fazer verificações condicionais, garantindo um código mais inteligente e adaptável. Atenção à indentação e sintaxe é fundamental!","moduleNumber":1,"chapterNumber":3,"lessonNumber":6,"file":"vd1_302.mp4","footer":"Agora é com você! Clique [[[EDITOR]]] e carregue o editor para praticar.","youtube_id":"CXbHcIK4pqU","youtube_title":"[Curso Python 1.3.6] If, Else e Elif: Tomando Decisões com o Código","video_contents":"Vamos avançar com as condicionais! Já usamos o if, agora vamos incluir o else (caso contrário) e o elif (caso intermediário). No exemplo do IMC, mostramos: se o valor for maior que 25, imprima “sobrepeso”; se for menor que 18.5, imprima “abaixo do peso”; caso contrário, imprima “peso normal”. As regras são simples: todas as instruções terminam com dois pontos, e a linha seguinte precisa estar indentada. Cuidado com a indentação e com erros de sintaxe! Ler as mensagens de erro ajuda muito. Condicionais tornam seu código inteligente e adaptável!"},{"id":47878,"chapterId":19201,"title":"Organizando Vários Dados em Listas","description":"Nesta aula, introduziremos as listas, um conceito fundamental. Inicialmente, criamos variáveis separadas para nomes como \"Amanda\" e \"Marcelo\", mas isso se mostrou ineficiente. Com as listas, aprenderemos a agrupar e acessar dados de forma organizada, tornando o código mais limpo e eficiente.","moduleNumber":1,"chapterNumber":4,"lessonNumber":1,"file":"vd1_401.mp4","footer":"Agora é com você! Clique [[[EDITOR]]] e carregue o editor para praticar.","youtube_id":"skO1zTjqjgE","youtube_title":"[Curso Python 1.4.1] Organizando Vários Dados em Listas","video_contents":"Nesta aula, vamos introduzir um conceito fundamental: as listas! Começamos criando variáveis separadas para armazenar nomes como “Amanda”, “Marcelo”, “Júlia”, “Rogério” e “Neusa”, usando name0, name1 e assim por diante. Funcionou, mas ficou trabalhoso e pouco prático. A partir disso, vamos aprender como usar listas para agrupar todos esses valores em uma única estrutura organizada, acessando cada item por sua posição. Usar listas torna o código mais limpo, eficiente e fácil de manter. Preparado para simplificar tudo com apenas uma variável? Vamos lá!"},{"id":17050,"chapterId":19201,"title":"Criando e Usando Sua Primeira Lista","description":"Nessa aula, simplificaremos o código criando e usando listas. Listas permitem armazenar múltiplos valores em uma única variável. Aprenda a criar listas de nomes usando colchetes e acesse os elementos por suas posições, lembrando que a indexação começa em zero. Vamos tornar o programa mais eficiente!","moduleNumber":1,"chapterNumber":4,"lessonNumber":2,"file":"vd1_402.mp4","footer":"Agora é com você! Clique [[[EDITOR]]] e carregue o editor para praticar.","youtube_id":"4xcuhm89WuA","youtube_title":"[Curso Python 1.4.2] Criando e Usando Sua Primeira Lista","video_contents":"Para simplificar o código da atividade anterior, vamos usar uma lista! Listas são estruturas que armazenam vários valores em uma única variável, facilitando repetições e organização. Criamos uma lista de nomes entre colchetes, com cada nome entre aspas e separado por vírgula. Para acessar os elementos, usamos a posição entre colchetes, lembrando que a contagem começa do zero! Assim, nomes[0] retorna o primeiro nome. Já ficou mais simples que criar várias variáveis, certo? E o melhor: ainda podemos deixar isso mais prático. Vamos em frente!"},{"id":37711,"chapterId":19201,"title":"Percorrendo Listas com o Comando FOR ","description":"Agora vamos aprender a percorrer listas usando o comando for. Esse método permite analisar cada item, um por vez, sem repetir linhas. A estrutura inicia com for, segue com dois pontos e a linha seguinte deve estar indentada. Utilize nomes claros e legíveis para facilitar a compreensão do código.","moduleNumber":1,"chapterNumber":4,"lessonNumber":3,"file":"vd1_403.mp4","footer":"Agora é com você! Clique [[[EDITOR]]] e carregue o editor para praticar.","youtube_id":"kqKYoWlg8fA","youtube_title":"[Curso Python 1.4.3] Percorrendo Listas com o Comando FOR ","video_contents":"Agora vamos aprender a percorrer listas usando o comando for. Isso nos permite analisar cada item da lista, um por vez, sem repetir linhas manualmente. A estrutura é parecida com o if: começa com for, termina com dois pontos e a linha seguinte precisa estar indentada. No exemplo, usamos for name in names: para acessar cada elemento da lista names e armazená-lo na variável name. Funciona com qualquer nome, mas lembre-se: o código deve ser claro e fácil de entender. Escreva pensando em quem vai ler depois de você. Clareza também é gentileza no mundo da programação!"},{"id":87960,"chapterId":19201,"title":"Dicionários: Chaves, Valores e Organização","description":"Agora vamos explorar dicionários em Python, que armazenam pares de chave e valor, como \"banana\": \"fruto da bananeira\". Essenciais para organizar dados de forma estruturada, são definidos com chaves ({}), diferenciando-se das listas. Vamos criar nossos próprios dicionários!","moduleNumber":1,"chapterNumber":4,"lessonNumber":4,"file":"vd1_501.mp4","footer":null,"youtube_id":"LXdv8zkCGDg","youtube_title":"[Curso Python 1.4.4] Dicionários: Chaves, Valores e Organização","video_contents":"Agora vamos aprender sobre dicionários em Python! Assim como um dicionário comum, eles armazenam pares de informação: uma chave e um valor. Por exemplo: \"banana\": \"fruto da bananeira\". A chave é como o verbete, e o valor é a explicação. Os dicionários são definidos entre chaves ({}), enquanto listas usam colchetes ([]). E atenção: não confunda o símbolo chaves (delimitador) com o termo chave (parte do par chave-valor). Dicionários permitem organizar dados de forma clara e estruturada, o que o Python adora! Vamos criar nossos próprios dicionários!"},{"id":97307,"chapterId":19201,"title":"Criando Seu Primeiro Dicionário","description":"Vamos colocar em prática o uso dos dicionários em Python! Iremos criar uma variável chamada 'person' e definir seu dicionário com chaves ({}). Incluiremos pares chave-valor como \"name\": \"Amanda\", e números para \"height\" e \"weight\". Por fim, exibiremos o conteúdo usando print(person).","moduleNumber":1,"chapterNumber":4,"lessonNumber":5,"file":"vd1_502.mp4","footer":"Agora é com você! Clique [[[EDITOR]]] e carregue o editor para praticar.","youtube_id":"0_-zcnvjqC8","youtube_title":"[Curso Python 1.4.5] Criando Seu Primeiro Dicionário","video_contents":"Vamos colocar em prática o uso dos dicionários em Python! Criamos uma variável chamada person e usamos chaves ({}) para definir o dicionário. Incluímos três pares chave-valor: \"name\" com o valor \"Amanda\", \"height\" com um número, e \"weight\" com outro número. As strings ficam entre aspas; os numbers, não. Colocamos cada par em uma linha separada para facilitar a leitura, embora não seja obrigatório. Por fim, usamos print(person) para exibir o conteúdo. Simples assim! Você irá criar e visualizar o seu primeiro dicionário."},{"id":67148,"chapterId":19201,"title":"Acessando Elementos em um Dicionário","description":"Agora nós vamos focar em acessar elementos individuais em um dicionário. Utilizando o dicionário da atividade anterior, veja como obter valores específicos usando colchetes e chaves. Compreenda os erros comuns e a importância da prática para dominar essa habilidade essencial.","moduleNumber":1,"chapterNumber":4,"lessonNumber":6,"file":"vd1_503.mp4","footer":"Agora é com você! Clique [[[EDITOR]]] e carregue o editor para praticar.","youtube_id":"YKyIsi2fShw","youtube_title":"[Curso Python 1.4.6] Acessando Elementos em um Dicionário","video_contents":"Vamos trabalhar com o dicionário criado na atividade anterior. Agora, em vez de imprimir tudo, vamos acessar apenas um item, usando sua chave. Para isso, usamos colchetes com a chave entre aspas: person[\"name\"]. Pode parecer confuso no início, afinal são muitas coisas: parênteses, colchetes, chaves e aspas! Mas calma, é normal errar no começo. Se usar o delimitador errado ou esquecer as aspas, o Python mostrará uma mensagem de erro. O importante é praticar! Com o tempo e a prática, tudo isso fará sentido. "},{"id":21824,"chapterId":19201,"title":"Adicionando Itens e Fazendo Cálculos no Dicionário","description":"Vamos avançar no uso dos dicionários! Nesta aula, adicionamos itens e realizamos cálculos, como o IMC, a partir de dados armazenados. Integre o resultado como um novo par chave-valor, \"BMI\": valor. Aprenda a acessar e atualizar informações de forma prática e organizada em Python.","moduleNumber":1,"chapterNumber":4,"lessonNumber":7,"file":"vd1_504.mp4","footer":"Agora é com você! Clique [[[EDITOR]]] e carregue o editor para praticar.","youtube_id":"OqSOSKfs524","youtube_title":"[Curso Python 1.4.7] Adicionando Itens e Fazendo Cálculos no Dicionário","video_contents":"Vamos avançar no uso dos dicionários! Agora, além de armazenar informações, vamos realizar cálculos. Criamos uma variável BMI para calcular o IMC com base na altura e peso armazenados no dicionário. Em seguida, adicionamos esse novo dado ao próprio dicionário como um novo par chave-valor: \"BMI\": valor. Ao imprimir person, vemos que o dicionário foi atualizado com essa nova informação. E claro, podemos acessar person[\"BMI\"] do mesmo jeito que fizemos com as outras chaves. Prático, poderoso e bem-organizado, esse é o jeito Python de trabalhar com dados!"},{"id":35067,"chapterId":63291,"title":"Listas e Dicionários: Entendendo as Diferenças","description":"Agora vamos combinar dois conceitos fundamentais: listas e dicionários! Exploramos como listas, criadas com colchetes, armazenam dados em sequência. Dicionários, por outro lado, usam chaves para organizar pares de chave-valor. Aprenda as diferenças essenciais entre essas estruturas.","moduleNumber":1,"chapterNumber":5,"lessonNumber":1,"file":"vd1_601.mp4","footer":"Agora é com você! Clique [[[EDITOR]]] e carregue o editor para praticar.","youtube_id":"P5ZaRxKvsIg","youtube_title":"[Curso Python 1.5.1] Listas e Dicionários: Entendendo as Diferenças","video_contents":"Agora vamos combinar dois conceitos importantes: listas e dicionários! Relembramos que listas são criadas com colchetes ([]) e armazenam vários dados em sequência, como nomes. Já os dicionários usam chaves ({}) e organizam pares de chave-valor, como \"name\": \"Amanda\". Ambos podem ser escritos em uma única linha ou com quebras para facilitar a leitura, o resultado será o mesmo. A diferença é que listas guardam elementos em série, enquanto dicionários estruturam os dados."},{"id":90433,"chapterId":63291,"title":"Lista de Dicionários: Estruturando Vários Dados","description":"Chegou a hora de unir tudo o que aprendemos: vamos criar uma lista de dicionários para estruturar dados complexos! Em vez de uma lista simples ou um único dicionário, construiremos uma lista chamada 'persons', com dicionários individuais por pessoa, usando chaves como 'name', 'height' e 'weight'.","moduleNumber":1,"chapterNumber":5,"lessonNumber":2,"file":"vd1_602.mp4","footer":"Agora é com você! Clique [[[EDITOR]]] e carregue o editor para praticar.","youtube_id":"AducRqDrBlg","youtube_title":"[Curso Python 1.5.2] Lista de Dicionários: Estruturando Vários Dados","video_contents":"Chegou a hora de unir tudo o que aprendemos: vamos criar uma lista de dicionários! Em vez de uma lista com nomes ou um único dicionário com dados de uma pessoa, agora teremos uma lista chamada persons, contendo vários dicionários, um para cada pessoa. Cada dicionário tem suas próprias chaves, como name, height e weight. Usar nomes de variáveis claros, como persons, é uma prática recomendada por gentileza com outros programadores. Copiar e adaptar blocos de código também é comum e eficiente. "},{"id":67159,"chapterId":63291,"title":"Acessando e Percorrendo uma Lista de Dicionários","description":"Vamos explorar uma lista 'persons' contendo cinco dicionários, cada um representando uma pessoa. Você aprenderá a exibir toda a lista, acessar itens individuais por índice e atribuir 'persons[0]' a uma variável. Também percorreremos a lista com um 'for', manipulando dados de forma clara e organizada.","moduleNumber":1,"chapterNumber":5,"lessonNumber":3,"file":"vd1_603.mp4","footer":"Agora é com você! Clique [[[EDITOR]]] e carregue o editor para praticar.","youtube_id":"9zENiCgLp84","youtube_title":"[Curso Python 1.5.3] Acessando e Percorrendo uma Lista de Dicionários","video_contents":"Nessa atividade, veremos uma lista persons com cinco dicionários, cada um representando uma pessoa. Podemos exibir tudo com um print(), mas também acessar itens individuais usando o índice, lembrando que o primeiro item está na posição 0. Ao atribuir persons[0] a uma variável chamada person, conseguimos acessar diretamente dados como person[\"name\"]. E como já aprendemos, também podemos percorrer a lista com um “for”, acessando cada dicionário de forma sequencial. Assim, conseguimos manipular e exibir informações com clareza e organização."},{"id":50899,"chapterId":63291,"title":"Calculando e Exibindo o IMC com Comentários","description":"Vamos explorar listas e dicionários calculando o IMC. Comentaremos o código com # para facilitar a compreensão. Calculamos o IMC acessando altura e peso dos dicionários, adicionando o campo \"BMI\". Por fim, imprimimos nome e IMC de cada pessoa, seguidos por uma linha decorativa de traços.","moduleNumber":1,"chapterNumber":5,"lessonNumber":4,"file":"vd1_604.mp4","footer":"Agora é com você! Clique [[[EDITOR]]] e carregue o editor para praticar.","youtube_id":"c3lnQUO-AUQ","youtube_title":"[Curso Python 1.5.4] Calculando e Exibindo o IMC com Comentários","video_contents":"Vamos continuar nossa jornada com listas e dicionários! Agora, adicionamos comentários ao código usando o símbolo # para explicar o que cada parte faz, uma prática importante e gentil com quem vai ler o código depois. Em seguida, calculamos o IMC de cada pessoa da lista persons, acessando altura e peso dentro dos dicionários e adicionando um novo campo \"BMI\". Depois, usamos um for para imprimir o nome e o IMC de cada um, seguidos por uma linha com 50 traços (\"-\" * 50) para organizar visualmente."},{"id":57557,"chapterId":63291,"title":"Classificando o IMC com Condicionais","description":"Chegamos à etapa final deste módulo! Usaremos if, elif e else para determinar o status de saúde com base no IMC. Aprenderemos a adicionar essas informações ao dicionário, lembrando da sintaxe correta para condicionais. Ao final, cada pessoa terá seu IMC e status calculado com precisão.","moduleNumber":1,"chapterNumber":5,"lessonNumber":5,"file":"vd1_605.mp4","footer":"Agora é com você! Clique [[[EDITOR]]] e carregue o editor para praticar.","youtube_id":"Ga30U_wHzxo","youtube_title":"[Curso Python 1.5.5] Classificando o IMC com Condicionais","video_contents":"Chegamos à etapa final deste módulo! Vamos usar o if, elif e else para adicionar uma nova informação ao nosso dicionário: o status da pessoa com base no IMC. Usamos as mesmas regras que já aprendemos: cada condição termina com dois pontos, e o bloco abaixo deve estar indentado. Claro, pequenos erros como esquecer os dois pontos são normais, e facilmente corrigidos! Ao final, cada pessoa terá seu IMC e o respectivo status (abaixo do peso, normal ou sobrepeso). O resultado ficou incrível!"},{"id":10849,"chapterId":63291,"title":"Revisando o Código Final","description":"Iremos revisar o código final deste módulo, dividido em dois blocos principais: uma lista de dicionários e um loop 'for'. No primeiro, manipulamos dados em strings e números. No segundo, calculamos o IMC e determinamos o status de cada pessoa usando 'if', 'elif' e 'else'. Comentários '#', garantem clareza.","moduleNumber":1,"chapterNumber":5,"lessonNumber":6,"file":"vd1_606.mp4","footer":null,"youtube_id":"oTBvITacVZg","youtube_title":"[Curso Python 1.5.6] Revisando o Código Final","video_contents":"Nessa atividade vamos revisar o código final deste módulo! Ele está dividido em dois blocos principais. O primeiro é uma lista de dicionários, organizada com colchetes e chaves, contendo dados como strings (com aspas) e numbers (sem aspas). O segundo é um loop com for, onde percorremos a lista para calcular o IMC (bmi) e determinar o status de cada pessoa com if, elif e else. Finalizamos com um print() bem formatado, e todo o código está comentado com # para facilitar a leitura. "},{"id":48239,"chapterId":96478,"title":"Explorando Conceitos e Ferramentas Avançadas","description":"Agora nós vamos revisar conceitos fundamentais e explorar novas ideias avançadas. Iremos instalar e utilizar ferramentas poderosas para o desenvolvimento de aplicações em Python, tudo explicado com clareza para garantir sua evolução segura e confiante no aprendizado.","moduleNumber":2,"chapterNumber":1,"lessonNumber":1,"file":"vd2_001.mp4","footer":null,"youtube_id":"eklTM-6GaC0","youtube_title":"[Curso Python 2.1.1] Explorando Conceitos e Ferramentas Avançadas","video_contents":"Neste segundo módulo, vamos revisar os conceitos fundamentais já vistos e avançar com novas ideias que se conectam a eles. Em seguida, daremos um passo importante ao aprender como instalar e utilizar ferramentas mais poderosas para o desenvolvimento de aplicações em Python. Tudo será explicado com clareza e atenção aos detalhes, para garantir que você siga evoluindo com segurança e confiança nessa jornada de aprendizado."},{"id":27493,"chapterId":48796,"title":"Blocos de Código e a Importância da Identação","description":"Neste encontro, revisaremos blocos de código em Python. Entenda a importância da indentação, que define o conteúdo de um bloco. Lembre-se do if: após os dois pontos, linhas com a mesma indentação pertencem ao bloco. Pratique com exemplos claros, preparando-se para estruturas mais complexas.","moduleNumber":2,"chapterNumber":2,"lessonNumber":1,"file":"vd2_101.mp4","footer":"Agora é com você! Clique [[[EDITOR]]] e carregue o editor para praticar.","youtube_id":"tWHGeyI2wSY","youtube_title":"[Curso Python 2.2.1] Blocos de Código e a Importância da Identação","video_contents":"Neste encontro, vamos revisar o conceito de blocos de código em Python. Você vai entender por que a indentação é essencial e como ela define o que está dentro de um bloco. Lembra do if? Após os dois pontos, todas as linhas com a mesma indentação pertencem ao mesmo bloco. Vamos praticar esse conceito com exemplos simples e claros, preparando o terreno para estruturas mais complexas ao longo do curso."},{"id":66290,"chapterId":48796,"title":"Revisando Blocos com Exemplo Prático","description":"Agora vamos revisar juntos um exemplo prático para reforçar blocos de código em Python. Note que linhas com dois pontos indicam blocos, onde as instruções alinhadas fazem parte. Com isso, escrever códigos organizados e funcionais se tornará mais natural para você.","moduleNumber":2,"chapterNumber":2,"lessonNumber":2,"file":"vd2_102.mp4","footer":"Agora é com você! Clique [[[EDITOR]]] e carregue o editor para praticar.","youtube_id":"MIDCFMBwsNc","youtube_title":"[Curso Python 2.2.2] Revisando Blocos com Exemplo Prático","video_contents":"Agora vamos revisar juntos um exemplo prático do módulo anterior para reforçar o conceito de blocos de código em Python. Você vai observar que, sempre que uma linha termina com dois pontos, as instruções que seguem com a mesma indentação fazem parte de um mesmo bloco. Com esse entendimento, escrever códigos mais organizados e funcionais se tornará cada vez mais natural para você."},{"id":54712,"chapterId":67214,"title":"Criando Suas Próprias Funções com DEF","description":"Exploraremos a criação de funções personalizadas em Python usando a palavra-chave def. Aprenda a estruturar blocos de código reutilizáveis e descubra como funções bem definidas melhoram a clareza e a eficiência dos seus projetos. Construa a base para escrever códigos mais organizados e potentes.","moduleNumber":2,"chapterNumber":3,"lessonNumber":1,"file":"vd2_201.mp4","footer":"Agora é com você! Clique [[[EDITOR]]] e carregue o editor para praticar.","youtube_id":"DWtIVTMM33U","youtube_title":"[Curso Python 2.3.1] Criando Suas Próprias Funções com DEF","video_contents":"Chegou a hora de aprender um novo tipo de bloco: as funções personalizadas! Em Python, usamos a palavra-chave def seguida de parênteses e dois pontos para criar uma função. As linhas com a mesma indentação após os dois pontos pertencem ao bloco dessa função. Por enquanto, nosso código ainda não executa nada, mas já estamos construindo uma estrutura reutilizável. Criar suas próprias funções é um passo fundamental para escrever códigos mais limpos, organizados e poderosos."},{"id":68974,"chapterId":67214,"title":"Entendendo Parâmetros e Retornos em Funções","description":"Agora nós vamos explorar funções personalizadas em Python. Usaremos 'def' para definir a função 'get_status', que recebe o parâmetro 'bmi'. Retornaremos valor com 'return', permitindo que você entenda como criar funções que aceitam entradas e devolvem resultados úteis.","moduleNumber":2,"chapterNumber":3,"lessonNumber":2,"file":"vd2_202.mp4","footer":"Agora é com você! Clique [[[EDITOR]]] e carregue o editor para praticar.","youtube_id":"891gh2Do9bI","youtube_title":"[Curso Python 2.3.2] Entendendo Parâmetros e Retornos em Funções","video_contents":"Vamos continuar explorando a função que criamos. Usamos def para definir a função e damos a ela o nome get_status, um nome sugestivo do que ela faz. Entre parênteses, indicamos que a função espera receber um parâmetro chamado bmi, mas esse nome pode ser qualquer um, desde que faça sentido. Por fim, usamos a palavra return para indicar que a função irá devolver um resultado. Com isso, você já começa a dominar o uso de funções personalizadas em Python!"},{"id":15647,"chapterId":67214,"title":"Reutilizando Funções e Simplificando o Código","description":"Agora vamos integrar a função personalizada ao nosso código principal. Primeiro, imprimimos o BMI. Em seguida, utilizamos a função get_status para simplificar e organizar. As funções evitam repetições, deixam o código limpo e são reutilizáveis, expandindo nosso vocabulário em Python.","moduleNumber":2,"chapterNumber":3,"lessonNumber":3,"file":"vd2_203.mp4","footer":"Agora é com você! Clique [[[EDITOR]]] e carregue o editor para praticar.","youtube_id":"bk-BDbkeEk8","youtube_title":"[Curso Python 2.3.3] Reutilizando Funções e Simplificando o Código","video_contents":"Agora vamos integrar a função personalizada ao nosso código principal. Primeiro, imprimimos o BMI. Depois, usamos a função get_status que criamos para deixar tudo mais simples e organizado. Isso mostra o poder das funções: elas evitam repetições, deixam o código mais limpo e podem ser reutilizadas quantas vezes quisermos. É como se estivéssemos expandindo o vocabulário do Python com comandos criados por nós mesmos!"},{"id":75648,"chapterId":68749,"title":"Organizando o Código em Múltiplos Arquivos","description":"Agora, vamos organizar seu código em múltiplos arquivos. Iremos separar a função get_status em myFunction.py e o restante em app.py, o que facilita a manutenção. Aprenderemos a usar o comando import e exploraremos um editor mais avançado, essencial para projetos maiores.","moduleNumber":2,"chapterNumber":4,"lessonNumber":1,"file":"vd2_301.mp4","footer":null,"youtube_id":"IiYVLYB8jaU","youtube_title":"[Curso Python 2.4.1] Organizando o Código em Múltiplos Arquivos","video_contents":"Neste momento, organizamos o código separando a função get_status em um arquivo chamado myFunction.py e o restante do código em app.py. Isso facilita a reutilização e manutenção do código. Para que funcione, usamos o comando import seguido do nome do arquivo (sem .py). Repare também que estamos usando um editor mais avançado, necessário quando lidamos com vários arquivos. Não se preocupe: na segunda parte do módulo, explicaremos tudo sobre esse novo ambiente."},{"id":35482,"chapterId":68749,"title":"Usando import para Reutilizar Funções","description":"Agora vamos importar a função get_status para nosso código principal usando import. Isso torna o código mais modular e organizado. Utilize o nome do arquivo sem .py e chame com myFunction.get_status(). Em breve, exploraremos como gerenciar melhor essas mensagens no console.","moduleNumber":2,"chapterNumber":4,"lessonNumber":2,"file":"vd2_302.mp4","footer":null,"youtube_id":"Ix_pXrEfTvo","youtube_title":"[Curso Python 2.4.2] Usando import para Reutilizar Funções","video_contents":"Agora vamos importar a função get_status para nosso código principal com a expressão import. Basta usar o nome do arquivo onde está a função (sem .py) e, depois, chamar a função com myFunction.get_status(). Isso deixa o código mais modular e organizado. Ao rodar, o resultado pode aparecer junto de outras mensagens, mas não se preocupe, em breve, vamos explorar isso com mais profundidade para que tudo faça sentido!"},{"id":14596,"chapterId":68749,"title":"Python, Comunidade Global e o Poder do PyPI","description":"Explore como o Python vai além de uma linguagem: é uma vibrante comunidade global. Entenda o papel da Python Software Foundation e a força do PyPI, onde milhares colaboram. Aprenda a usar o comando import para aproveitar essas contribuições e ampliar as possibilidades de seus projetos.","moduleNumber":2,"chapterNumber":4,"lessonNumber":3,"file":"vd2_303.mp4","footer":null,"youtube_id":"RDG1nVSEWsY","youtube_title":"[Curso Python 2.4.3] Python, Comunidade Global e o Poder do PyPI","video_contents":"O Python é muito mais do que uma linguagem de programação, é uma comunidade global. Através da Python Software Foundation, milhares de voluntários contribuem com funções, bibliotecas e ferramentas que estão disponíveis no PyPI (Python Package Index). Com o comando import, você pode acessar essas contribuições e fazer praticamente qualquer coisa com Python. Isso transforma a linguagem em uma poderosa plataforma aberta, colaborativa e em constante evolução."},{"id":17745,"chapterId":68749,"title":"Exemplo de import: pacote datetime","description":"Agora vamos explorar o pacote datetime para manipulação de datas. Após entender que strings e números não lidam bem com datas, veremos como o datetime resolve essa limitação. Descubra como evitar erros como TypeError ao subtrair datas, usando este poderoso recurso do Python.","moduleNumber":2,"chapterNumber":4,"lessonNumber":4,"file":"vd2_304.mp4","footer":"Agora é com você! Clique [[[EDITOR]]] e carregue o editor para praticar.","youtube_id":"4wgs13WauD4","youtube_title":"[Curso Python 2.4.4] Exemplo de import: pacote datetime","video_contents":"A título de exemplo do recurso import, vamos explorar um dos pacotes mais populares do Python: o datetime. No módulo anterior, vimos as diferenças entre strings e números. Agora, percebemos que nenhum desses formatos é adequado para lidar com datas. Ao tentar subtrair datas como strings, o Python exibe um erro TypeError: unsupported operand type. Isso acontece porque ele não reconhece que se trata de datas. "},{"id":20351,"chapterId":68749,"title":"Mais Exemplos Usando o datetime","description":"Agora vamos explorar o pacote datetime, importando-o com o apelido dt para clareza no código. Com ele, criaremos datas reais e faremos operações, como subtrações entre datas, obtendo a diferença em dias. O datetime é extenso, com muitas funcionalidades a explorar na documentação.","moduleNumber":2,"chapterNumber":4,"lessonNumber":5,"file":"vd2_305.mp4","footer":"Agora é com você! Clique [[[EDITOR]]] e carregue o editor para praticar.","youtube_id":"w9PdKCNf3dw","youtube_title":"[Curso Python 2.4.5] Mais Exemplos Usando o datetime","video_contents":"Agora vamos importar o pacote datetime e dar a ele um apelido (dt) para facilitar a leitura do código. Com a função datetime, podemos criar datas reais usando ano, mês e dia, sempre nessa ordem. Assim, conseguimos realizar operações como subtrações entre datas, que retornam o número de dias entre elas. Esse é só um exemplo: o pacote datetime é bem completo e possui várias outras funcionalidades que você poderá explorar na documentação oficial."},{"id":90210,"chapterId":35048,"title":"Ambientes IDE: Web ou Local","description":"Chegou a hora de explorar o uso de Python em uma IDE. Vamos comparar ambientes web, como Jupyter Lab e Google Colab, ótimos para iniciantes, com ambientes locais, como o popular Visual Studio Code. Descubra por que o VS Code é a escolha ideal para projetos robustos e como utilizá-lo efetivamente.","moduleNumber":2,"chapterNumber":5,"lessonNumber":1,"file":"vd2_401.mp4","footer":null,"youtube_id":"3GbTNltfAoc","youtube_title":"[Curso Python 2.5.1] Ambientes IDE: Web ou Local","video_contents":"Chegou a hora de dar um passo importante: usar Python em uma IDE, Integrated Development Environment, ou Ambiente Integrado de Desenvolvimento. Existem duas categorias: os ambientes web, como Jupyter Lab e Google Colab, ótimos para começar; e os ambientes locais, como o Visual Studio Code, ideais para projetos mais robustos. Minha dica? Vá direto para o VS Code. Ele é gratuito, completo e o mais usado no mundo. É com ele que vamos seguir a partir de agora."},{"id":80145,"chapterId":35048,"title":"Instalando o Python no Seu Computador","description":"Vamos iniciar configurando seu ambiente local ao instalar o Python. Acesse python.org, baixe a versão mais recente na aba 'Downloads' e execute o instalador. Com o Python pronto, você pode começar a programar localmente e usar editores como o VS Code futuramente.","moduleNumber":2,"chapterNumber":5,"lessonNumber":2,"file":"vd2_402.mp4","footer":null,"youtube_id":"25jJidriWrE","youtube_title":"[Curso Python 2.5.2] Instalando o Python no Seu Computador","video_contents":"Vamos começar a configurar seu ambiente local instalando o Python. Acesse o site oficial python.org, clique na aba “Downloads” e baixe a versão mais recente. Após o download, execute o instalador e aguarde a conclusão. Pronto! Agora você tem o Python instalado no seu computador e já pode começar a programar localmente. Essa é a base para usarmos editores como o VS Code nas próximas etapas."},{"id":50620,"chapterId":35048,"title":"Instalando e Configurando o VS Code","description":"Vamos instalar o Visual Studio Code como nosso ambiente de desenvolvimento. Acesse o site oficial, faça o download e siga as configurações padrão. Em seguida, abrimos o VS Code, acessamos a aba “Extensions” e instalamos as extensões Python e Jupyter para maximizar sua produtividade com Python.","moduleNumber":2,"chapterNumber":5,"lessonNumber":3,"file":"vd2_403.mp4","footer":null,"youtube_id":"Iu0IkzkWbsw","youtube_title":"[Curso Python 2.5.3] Instalando e Configurando o VS Code","video_contents":"Vamos instalar o Visual Studio Code, nosso ambiente de desenvolvimento local. Acesse o site oficial, clique em “Download” e instale com as configurações padrão. Em seguida, abrimos o VS Code e instalamos duas extensões essenciais: Python (para executar seus códigos) e Jupyter (para notebooks interativos). Basta ir na aba “Extensions” (ícone dos quadradinhos), buscar pelos nomes, instalar e pronto! Agora seu VS Code está pronto para rodar Python com facilidade e eficiência."},{"id":23650,"chapterId":35048,"title":"Seu Primeiro Arquivo Python no VS Code","description":"Chegou a hora de criar seu primeiro arquivo Python no VS Code! Aprenda a abrir uma pasta e a importância de trabalhar dentro delas. Crie o arquivo 'app.py' e escreva seu primeiro comando: print(\"Hello\"). Execute o código e veja-o funcionando. Um pequeno passo para sua jornada como programador.","moduleNumber":2,"chapterNumber":5,"lessonNumber":4,"file":"vd2_404.mp4","footer":"Agora é com você! Carregue o VS Code e pratique essa aula.","youtube_id":"Nz-F_Lw8MqM","youtube_title":"[Curso Python 2.5.4] Seu Primeiro Arquivo Python no VS Code","video_contents":"Chegou a hora de criar seu primeiro arquivo Python no VS Code! Abra uma pasta pelo menu “File > Open Folder”, trabalhar dentro de pastas é fundamental. No exemplo, usamos a pasta “Teste”. Clique em “New File” e crie o arquivo app.py. Agora escreva um comando simples, como print(\"Hello\"), e clique no ícone de execução no canto superior direito. Pronto! Seu código foi executado com sucesso. Um pequeno passo para você, um grande passo como programador."},{"id":52013,"chapterId":35048,"title":"Rodando Arquivos .ipynb com Jupyter no VS Code","description":"Agora nós vamos explorar como rodar arquivos .ipynb no VS Code. Criaremos o arquivo app.ipynb, adequado ao Jupyter, permitindo a execução de blocos de código em células com saídas imediatas. Graças à extensão Jupyter, essa funcionalidade é habilitada. Mensagens de segurança podem surgir inicialmente.","moduleNumber":2,"chapterNumber":5,"lessonNumber":5,"file":"vd2_405.mp4","footer":"Agora é com você! Carregue o VS Code e pratique essa aula.","youtube_id":"SgL4m2i-w4U","youtube_title":"[Curso Python 2.5.5] Rodando Arquivos .ipynb com Jupyter no VS Code","video_contents":"Agora criamos um novo tipo de arquivo: app.ipynb, o formato usado pelo Jupyter. Esse tipo de arquivo permite rodar blocos de código em células, com saída imediata logo abaixo. Isso é possível graças à extensão do Jupyter que instalamos anteriormente. Na primeira execução, algumas mensagens de segurança ou instalação extra podem aparecer, é normal. Parabéns por chegar até aqui!"},{"id":76575,"chapterId":59227,"title":"Introdução ao Módulo de Dados e IA","description":"Agora vamos iniciar um módulo crucial que integra conceitos anteriores. Será desafiador, mas cada passo será detalhado. Transcreva os códigos para o VS Code após cada vídeo. A prática é vital: digite, teste, altere e aprenda com os erros. Sua dedicação trará frutos na jornada com Python.","moduleNumber":3,"chapterNumber":1,"lessonNumber":1,"file":"vd3_001.mp4","footer":null,"youtube_id":"KeGtBnAayMk","youtube_title":"[Curso Python 3.1.1] Introdução ao Módulo de Dados e IA","video_contents":"Agora vamos iniciar um módulo muito importante, que irá integrar conceitos dos módulos anteriores. Essa fase será um pouco mais desafiadora, mas cada passo será explicado detalhadamente. É essencial que você transcreva os códigos mostrados para o seu VS Code ao final de cada vídeo. A prática é fundamental para dominar este conteúdo, então após cada lição, digite o código, faça testes, altere parâmetros e aprenda com os erros. Sua dedicação agora renderá frutos na sua jornada com Python."},{"id":94036,"chapterId":59227,"title":"Instalação de Pacotes com PIP","description":"Vamos aprender a instalar pacotes essenciais utilizando o pip. Iniciaremos verificando a configuração através do comando 'pip list'. Caso necessário, ajustaremos o path nas variáveis de ambiente. Após isso, prosseguiremos com a instalação, facilitando a gestão de pacotes em Python de maneira prática e eficiente.","moduleNumber":3,"chapterNumber":1,"lessonNumber":2,"file":"vd3_002.mp4","footer":null,"youtube_id":"yEuasJJyUEc","youtube_title":"[Curso Python 3.1.2] Instalação de Pacotes com PIP","video_contents":"Vamos aprender a instalar os pacotes necessários para este módulo utilizando o comando pip. Primeiro, abra o prompt de comando ou terminal, e verifique se o pip está reconhecido com o comando 'pip list'. Caso contrário, faremos a configuração correta. Após ajustar o path nas variáveis de ambiente do sistema, você estará apto a instalar pacotes. Vamos então prosseguir com a instalação dos pacotes essenciais para o curso. Veremos como facilitar o processo de instalação e gestão de pacotes em Python de forma prática e eficiente."},{"id":74631,"chapterId":59227,"title":"Configuração do Ambiente de Trabalho","description":"Vamos preparar o ambiente para o módulo 3 em Python. Crie uma pasta \"modulo3\", baixe o arquivo \"profiles.xlsx\" e mova-o para a pasta. Abra o Visual Studio Code e acesse \"modulo3\". Essa configuração inicial é essencial para as atividades práticas do curso.","moduleNumber":3,"chapterNumber":1,"lessonNumber":3,"file":"vd3_003.mp4","footer":"Clique <a href=\"https:\/\/www.solvertank.tech\/solverpy\/files\/profiles.xlsx\">AQUI<\/a> para baixar o arquivo \"profiles.xlsx\"","youtube_id":"WPwcaZ0RGOY","youtube_title":"[Curso Python 3.1.3] Configuração do Ambiente de Trabalho","video_contents":"Vamos preparar o ambiente para as atividades do módulo 3 em Python. Crie uma pasta nomeada \"modulo3\" em seu computador. Em seguida, baixe o arquivo \"profiles.xlsx\" através do link disponível. Mova o arquivo baixado para a pasta criada. Agora, abra o Visual Studio Code e acesse a pasta \"modulo3\". Se feito corretamente, você verá o arquivo na lista, embora o VS Code não exiba seu conteúdo por padrão. Essa configuração inicial é essencial para prosseguirmos com as atividades práticas do curso."},{"id":61453,"chapterId":59227,"title":"Criando e Executando Notebooks","description":"Agora nós vamos explorar a criação e gestão de notebooks no Jupyter. Iremos criar o arquivo 'app.ipynb', inserir comandos em Python e executar para garantir seu funcionamento. Você verá a criação de 'modulo3' com 'app.ipynb' e 'profiles'. Essa aula é crucial para organizar e executar códigos Python eficientemente.","moduleNumber":3,"chapterNumber":1,"lessonNumber":4,"file":"vd3_004.mp4","footer":"Agora é com você! Carregue o VS Code e pratique essa aula.","youtube_id":"tLqdU5r-BwI","youtube_title":"[Curso Python 3.1.4] Criando e Executando Notebooks","video_contents":"Agora nós vamos aprender a criar e gerenciar notebooks no Jupyter. Primeiramente, vamos criar um novo arquivo chamado 'app.ipynb'. Certifique-se de abrir uma nova célula de código e escolher a opção Python. Escreva um comando 'print' simples e execute-o para verificar se tudo está funcionando corretamente. Se seguir essas etapas, você verá que a pasta 'modulo3' foi criada com dois arquivos: 'app.ipynb' e 'profiles'. Essa aula é essencial para entender como organizar e executar códigos Python em notebooks, facilitando o desenvolvimento e a comunicação de ideias."},{"id":97318,"chapterId":52319,"title":"Introdução ao Pandas: Manipulação de Dados","description":"Essa aula é sobre o poderoso pacote Pandas, essencial para manipulação de dados em Python. Exploraremos suas funcionalidades, como importar bibliotecas, criar DataFrames e executar operações de filtragem e agrupamento. Com o Pandas, a análise de dados torna-se mais simples e eficiente.","moduleNumber":3,"chapterNumber":2,"lessonNumber":1,"file":"vd3_101.mp4","footer":"Agora é com você! Carregue o VS Code e pratique essa aula.","youtube_id":"SoFHfQ_1JrU","youtube_title":"[Curso Python 3.2.1] Introdução ao Pandas: Manipulação de Dados","video_contents":"Essa aula é sobre o poderoso pacote Pandas, essencial para manipulação de dados em Python. Vamos explorar suas funcionalidades, que ajudam a organizar, analisar e visualizar informações de forma eficiente. Iremos aprender a importar bibliotecas, criar DataFrames e realizar operações básicas de filtragem e agrupamento. Com o Pandas, muitos desafios de análise de dados tornam-se mais simples, tornando-se uma ferramenta indispensável para quem atua com dados."},{"id":37521,"chapterId":52319,"title":"Filtragem de Dados com Pandas","description":"Iremos abordar a seleção de colunas específicas em dataframes com Pandas para clareza visual. Você aprenderá a criar listas de nomes de colunas para filtragem horizontal e como definir condições com '==', permitindo a filtragem vertical. Por fim, combinaremos métodos para uma análise completa. Esses fundamentos suportam análises avançadas.","moduleNumber":3,"chapterNumber":2,"lessonNumber":2,"file":"vd3_102.mp4","footer":"Agora é com você! Carregue o VS Code e pratique essa aula.","youtube_id":"BP5G_UKwx5g","youtube_title":"[Curso Python 3.2.2] Filtragem de Dados com Pandas","video_contents":"Iremos abordar como selecionar colunas específicas de um dataframe para visualizar dados de forma mais clara. Você aprenderá a criar listas com nomes de colunas para filtrar horizontalmente. Além disso, veremos como definir condições utilizando o sinal duplo de igual, permitindo filtrar linhas específicas, ou seja, visualizando dados verticalmente. Por fim, combinaremos ambos os métodos para uma análise completa, mostrando como manipular visualizações no Pandas. Esses fundamentos serão a base para análises de dados avançadas."},{"id":45896,"chapterId":52319,"title":"Fazendo Loops em DataFrames","description":"Vamos explorar como utilizar loops para iterar sobre DataFrames em Python. Focaremos no método \"iterrows\" para navegar por cada linha como uma lista de dicionários. Você irá compreender a importância dessa técnica, essencial na manipulação de dados. Exemplos práticos consolidarão o aprendizado.","moduleNumber":3,"chapterNumber":2,"lessonNumber":3,"file":"vd3_103.mp4","footer":"Agora é com você! Carregue o VS Code e pratique essa aula.","youtube_id":"GZp0Ep1mMzg","youtube_title":"[Curso Python 3.2.3] Fazendo Loops em DataFrames","video_contents":"Vamos explorar como utilizar loops para iterar sobre DataFrames em Python. Utilizaremos o método \"iterrows\" para navegar por cada linha de um DataFrame, como se fosse uma lista de dicionários. Durante essa aula, faremos ajustes em loops tradicionais, adaptando-os para trabalhar com dados tabulares de forma eficiente. Você irá compreender a importância e a aplicação dessa técnica, que é fundamental para manipulação de dados em Python. Vamos reforçar o conceito com exemplos práticos para consolidar o aprendizado."},{"id":14421,"chapterId":52319,"title":"Manipulando e Salvando DataFrames","description":"Agora nós vamos explorar a manipulação de DataFrames com Pandas. Veremos como listar e adicionar colunas, calculando o 'bmi'. Após a criação, verificaremos as alterações e aprenderemos a salvar em um novo Excel. Esta aula é essencial para gerenciar dados de maneira eficaz e organizada.","moduleNumber":3,"chapterNumber":2,"lessonNumber":4,"file":"vd3_104.mp4","footer":"Agora é com você! Carregue o VS Code e pratique essa aula.","youtube_id":"w6jIB33iwo4","youtube_title":"[Curso Python 3.2.4] Manipulando e Salvando DataFrames","video_contents":"Agora nós vamos explorar como manipular DataFrames usando o Pandas. Veremos como listar e adicionar novas colunas, como a 'bmi', que calcula o índice de massa corpórea. Após criar essa coluna, vamos verificar a modificação no DataFrame. Por último, aprenderemos a salvar as alterações em um novo arquivo Excel, mostrando que é possível abrir, modificar e armazenar dados facilmente. Essa prática é fundamental para trabalhar com dados de forma eficiente e organizada. Vamos colocar tudo isso em ação!"},{"id":13200,"chapterId":52319,"title":"Funções e Manipulação de DataFrames","description":"Vamos aprender a integrar funções personalizadas em DataFrames, aplicando conhecimentos prévios. Focaremos na reutilização de funções, como a que calcula o IMC, usando o comando apply para gerar novas colunas. Você observará o uso da função round para ajustar dados, garantindo resultados precisos.","moduleNumber":3,"chapterNumber":2,"lessonNumber":5,"file":"vd3_105.mp4","footer":"Agora é com você! Carregue o VS Code e pratique essa aula.","youtube_id":"DzXjCUFySMo","youtube_title":"[Curso Python 3.2.5] Funções e Manipulação de DataFrames","video_contents":"Vamos aprender a integrar funções personalizadas em DataFrames, aplicando conceitos explorados em módulos anteriores. Esta aula foca na reciclagem de funções, como a que calcula o IMC, usando o comando apply para criar colunas e gerar insights. Você irá observar como usar a função round para ajustar a precisão dos dados e monitorar todo o processo para garantir resultados precisos e satisfatórios. Ao final, ao executar o notebook, verá como essas técnicas ampliam as possibilidades de análise ampliando o número de colunas no seu dataframe."},{"id":44191,"chapterId":52319,"title":"Pandas: Calculando IMC com Excel","description":"Agora nós vamos explorar como usar o Pandas para calcular o IMC de várias pessoas a partir de um arquivo Excel. Essa aula mostra como essa abordagem lida com grandes volumes de dados. Iremos comparar com técnicas simples do módulo 1, capacitando você a importar e analisar planilhas com eficiência.","moduleNumber":3,"chapterNumber":2,"lessonNumber":6,"file":"vd3_106.mp4","footer":null,"youtube_id":"TfG_T95Ve2Q","youtube_title":"[Curso Python 3.2.6] Pandas: Calculando IMC com Excel","video_contents":"Agora nós vamos explorar como usar o Pandas para calcular o IMC de uma série de pessoas utilizando um arquivo Excel como fonte de dados. Essa aula mostra como essa abordagem permite lidar com grandes volumes de dados, algo que não seria viável com dados digitados diretamente no código. Iremos comparar as diferenças entre o uso do Pandas neste módulo e as técnicas mais simples utilizadas no módulo 1. Ao final, você estará apto a importar, manipular e analisar dados de planilhas com eficiência."},{"id":82991,"chapterId":20380,"title":"Incorporando IA e APIs no Python","description":"Nessa aula, você irá explorar como usar Python para integrar inteligência artificial em seus projetos. Abordaremos prompts e chamadas de APIs, com foco na popular IA da OpenAI. As técnicas serão adaptáveis a outras IAs, desmistificando seu uso para um código mais poderoso e interativo.","moduleNumber":3,"chapterNumber":3,"lessonNumber":1,"file":"vd3_201.mp4","footer":"Clique <a target=\"_blank\" href=\"https:\/\/platform.openai.com\/\">AQUI<\/a> para acessar o console da OpenAI.\"","youtube_id":"pHql11CaauI","youtube_title":"[Curso Python 3.3.1] Incorporando IA e APIs no Python","video_contents":"Nessa aula, você irá explorar como usar Python para integrar inteligência artificial em seus projetos. Aprenderemos a trabalhar com prompts e chamadas de APIs, focando na popular IA da OpenAI. Embora usemos esta API como exemplo principal, as técnicas ensinadas serão adaptáveis a outras IAs com modificações mínimas. Vamos desmistificar o uso dessas ferramentas, tornando seu código mais poderoso e interativo. Prepare-se para dar um grande passo na implementação de IA em seus programas Python!"},{"id":99095,"chapterId":20380,"title":"Criando Scripts com API OpenAI","description":"Agora vamos explorar a criação de scripts utilizando a IA. Começaremos com um novo arquivo IPYNB e importando o pacote OpenAI. Definiremos a variável \"api_key\" e usaremos \"client\" para interagir com a API, preparando o ambiente para funcionalidades avançadas.","moduleNumber":3,"chapterNumber":3,"lessonNumber":2,"file":"vd3_202.mp4","footer":"Agora é com você! Carregue o VS Code e pratique essa aula.","youtube_id":"CGSgwxWYFqU","youtube_title":"[Curso Python 3.3.2] Criando Scripts com API OpenAI","video_contents":"Agora vamos explorar a criação de scripts utilizando a IA. Começaremos abrindo um novo arquivo IPYNB e importando o pacote da OpenAI. Ao executar esta célula, nenhuma mensagem de retorno deverá aparecer. Depois, você irá definir uma variável chamada \"api_key\" e inserir a chave obtida anteriormente. Em seguida, criaremos outra variável chamada \"client\" utilizando a biblioteca importada, passando a chave da API como parâmetro. Isso irá preparar o ambiente para interagir com a API e explorar funcionalidades avançadas."},{"id":17052,"chapterId":20380,"title":"Manipulação de Variáveis e Estruturas","description":"Vamos explorar a criação e uso de variáveis em Python, focando em listas e dicionários. Aprenda a inicializar listas, adicionar dicionários com pares chave-valor e manipular respostas de funções. Entenda como esses conceitos são essenciais para o desenvolvimento de aplicações mais complexas.","moduleNumber":3,"chapterNumber":3,"lessonNumber":3,"file":"vd3_203.mp4","footer":"Agora é com você! Carregue o VS Code e pratique essa aula.","youtube_id":"88UzSz5xxoI","youtube_title":"[Curso Python 3.3.3] Manipulação de Variáveis e Estruturas","video_contents":"Nessa aula, abordaremos a criação e uso de variáveis em Python, começando pela definição de listas e dicionários. Vamos entender como inicializar uma lista e adicionar dicionários dentro dela, cada um contendo pares chave-valor. Exploraremos como as chaves e valores funcionam, utilizando um exemplo de interação com uma IA. Também aprenderemos a armazenar e manipular respostas de funções e como recuperar seus resultados de forma eficaz. Esse conhecimento é fundamental para desenvolver aplicações mais complexas no futuro."},{"id":88633,"chapterId":20380,"title":"Passando Instruções para a API","description":"Agora nós vamos aprimorar a interação com a API, aprendendo a passar instruções específicas através de uma lista de \"messages\". Exploraremos a inclusão de múltiplos dicionários nessa lista para uma comunicação mais detalhada, otimizando consultas e esclarecendo intenções durante a transmissão de instruções.","moduleNumber":3,"chapterNumber":3,"lessonNumber":4,"file":"vd3_204.mp4","footer":"Agora é com você! Carregue o VS Code e pratique essa aula.","youtube_id":"V9Lty8m6Jw4","youtube_title":"[Curso Python 3.3.4] Passando Instruções para a API","video_contents":"Agora nós vamos melhorar a interação com a API, aprendendo a passar instruções específicas através de uma lista de \"messages\". Isso envolve a inclusão de múltiplos dicionários dentro da lista, permitindo uma comunicação mais complexa e detalhada. Vamos explorar como adicionar essas instruções pode otimizar nossas consultas e dar mais clareza ao que desejamos comunicar. Você vai ver como as instruções são transmitidas e interpretadas pela API, enriquecendo suas habilidades na utilização dessa ferramenta poderosa."},{"id":33238,"chapterId":20380,"title":"Passando prompts mais complexos","description":"Nessa aula, vamos elaborar prompts mais complexos usando concatenação de strings. Exploraremos aspas triplas para múltiplas linhas e operadores '+' e '+=' para unir strings. Revisaremos conceitos anteriores e, ao final, você estará apto a criar textos complexos e incorporar variáveis eficientemente.","moduleNumber":3,"chapterNumber":3,"lessonNumber":5,"file":"vd3_205.mp4","footer":"Agora é com você! Carregue o VS Code e pratique essa aula.","youtube_id":"eoPMPUb59gk","youtube_title":"[Curso Python 3.3.5] Passando prompts mais complexos","video_contents":"Nessa aula vamos elaborar prompts mais complexos através da concatenação de strings. Iremos explorar como usar aspas triplas para criar strings de múltiplas linhas e a utilização de operadores como '+' e '+=' para unir strings. Vamos também revisar conceitos discutidos no módulo anterior. Ao final, você estará apto a criar textos complexos e incorporar variáveis em strings, tornando seu código mais legível e eficiente."},{"id":38197,"chapterId":64309,"title":"Consolidação e Integração de Python","description":"Vamos consolidar nossos conhecimentos criando um código coeso. Abriremos a planilha 'profiles', calcularemos o IMC e usaremos a API da OpenAI para recomendações personalizadas. Finalizamos exportando os dados processados para uma nova planilha de forma organizada e eficiente.","moduleNumber":3,"chapterNumber":4,"lessonNumber":1,"file":"vd3_301.mp4","footer":null,"youtube_id":"Q2A3kmMeTmw","youtube_title":"[Curso Python 3.4.1] Consolidação e Integração de Python","video_contents":"Vamos consolidar nossos conhecimentos reunidos até aqui, criando um único código coeso. Vamos explicar o que será feito nas demais aulas. Começaremos abrindo a planilha \"profiles\" usada anteriormente e percorremos cada registro para calcular o IMC e determinar o status. Em seguida, integraremos a API da OpenAI para obter recomendações personalizadas de acordo com os dados processados. Por fim, exportaremos tudo para uma nova planilha, organizando as informações de forma prática e eficiente."},{"id":66754,"chapterId":64309,"title":"Integração de APIs com Pandas","description":"Agora nós vamos avançar no projeto integrando APIs de inteligência artificial com a biblioteca Pandas. Importaremos o pacote da OpenAI e configuraremos as credenciais. Gerenciaremos a chave e o cliente em uma célula, ajustando o loop para processar dados de \"profiles\". Enriqueça seu código!","moduleNumber":3,"chapterNumber":4,"lessonNumber":2,"file":"vd3_302.mp4","footer":"Agora é com você! Carregue o VS Code e pratique essa aula.","youtube_id":"EljVHn-DHGo","youtube_title":"[Curso Python 3.4.2] Integração de APIs com Pandas","video_contents":"Agora nós vamos avançar no projeto integrando APIs de inteligência artificial com a biblioteca Pandas. Iniciaremos importando o pacote da OpenAI e configuraremos as credenciais necessárias. Em seguida, criaremos uma célula para gerenciar a chave e o cliente. Depois, ajustaremos o loop existente para recuperar e processar os dados de cada linha do arquivo \"profiles\". Essa abordagem permitirá enriquecer o processamento dos dados, aplicando instruções específicas e personalizadas para cada pessoa. Prepare-se para ver seu código ganhar novos poderes com essa integração!"},{"id":49962,"chapterId":64309,"title":"Concatenação e Conversão de Dados","description":"Vamos aprender a concatenar strings com '+', além de converter números em strings usando `str` para evitar erros. Exploraremos o ajuste de mensagens e a implementação de chamadas de API com 'print'. Pronto para colocar tudo em prática?","moduleNumber":3,"chapterNumber":4,"lessonNumber":3,"file":"vd3_303.mp4","footer":"Agora é com você! Carregue o VS Code e pratique essa aula.","youtube_id":"ZG1Bwr20lco","youtube_title":"[Curso Python 3.4.3] Concatenação e Conversão de Dados","video_contents":"Vamos aprender a concatenar strings em Python utilizando o operador '+' e entender como lidar com dados numéricos. Iremos converter números em strings usando a função `str`, essencial para evitar erros durante operações de concatenação. Além disso, abordaremos o ajuste do bloco de mensagens e a implementação da chamada da API com um simples 'print'. Pronto para rodar o código com essas integrações? É hora de colocar tudo em prática!"},{"id":50051,"chapterId":64309,"title":"Executando o script completo","description":"Agora nós vamos executar o script completo, percorrendo a planilha com loops para extrair e manipular dados linha por linha. Integraremos chamadas a uma IA para automatizar processos, utilizando `pandas` para manipulação eficiente. Transforme operações manuais em fluxos ágeis e inteligentes.","moduleNumber":3,"chapterNumber":4,"lessonNumber":4,"file":"vd3_304.mp4","footer":"Agora é com você! Carregue o VS Code e pratique essa aula.","youtube_id":"QBHd1OEg8NQ","youtube_title":"[Curso Python 3.4.4] Executando o script completo","video_contents":"Vamos agora rodar tudo, percorrendo a planilha utilizando loops, extraindo e manipulando dados linha por linha. Você irá integrar chamadas a uma IA para processar informações automaticamente, transformando operações manuais em fluxos de trabalho eficientes. Veremos como o `pandas` ajuda para manipulação de dados e estratégias para interfacear com serviços de IA, ampliando o poder de suas automações. Essa abordagem tornará o processamento de dados de planilhas muito mais dinâmico e inteligente."},{"id":74006,"chapterId":75139,"title":"Organizando Código em Módulos","description":"Iremos abordar a importância de dividir seu script em múltiplos arquivos, promovendo clareza e manutenção fácil. Nesta aula, você aprenderá a criar e utilizar módulos em Python, tornando o código mais modular e reutilizável. Exploraremos práticas para estruturar projetos eficazmente.","moduleNumber":3,"chapterNumber":5,"lessonNumber":1,"file":"vd3_401.mp4","footer":null,"youtube_id":"Afcm43JVWJ0","youtube_title":"[Curso Python 3.5.1] Organizando Código em Módulos","video_contents":"Uma abordagem essencial ao programar é garantir que seu código seja limpo e bem-organizado. Iremos abordar a importância de dividir seu script Python em vários arquivos, facilitando a compreensão e manutenção. Nesta aula, você irá aprender a criar e utilizar módulos em Python, permitindo que seu código se torne mais modularizado e reutilizável. Vamos explorar as melhores práticas para estruturar seu projeto de forma que cada parte do código tenha um propósito claro, tornando o processo de desenvolvimento mais eficiente."},{"id":23582,"chapterId":75139,"title":"Organização de Código com Módulos","description":"Vamos aprender a organizar nosso projeto em Python utilizando módulos. Começaremos criando uma estrutura de pastas para separar funcionalidades, promovendo clareza e fácil manutenção. A pasta 'functions' alojará arquivos como 'data.py' para acesso a dados e 'ai.py' para inteligência artificial.","moduleNumber":3,"chapterNumber":5,"lessonNumber":2,"file":"vd3_402.mp4","footer":"Agora é com você! Carregue o VS Code e pratique essa aula.","youtube_id":"rgvLDGzR8Gg","youtube_title":"[Curso Python 3.5.2] Organização de Código com Módulos","video_contents":"Vamos aprender a organizar nosso projeto em Python utilizando módulos. Inicialmente, iremos criar uma estrutura de pastas para separar funcionalidades distintas, facilitando o gerenciamento e a compreensão do código. Primeiramente, criaremos a pasta \"functions\" para abrigar arquivos de função específicos. O arquivo \"data.py\" conterá funções de acesso a dados, enquanto o \"ai.py\" será dedicado às funções de inteligência artificial. Essa segregação de responsabilidades não apenas promove clareza e organização, mas também facilita a manutenção e expansão do projeto."},{"id":87778,"chapterId":75139,"title":"Projeto Estruturado com Jupyter Notebook","description":"Agora nós vamos estruturar um projeto usando Jupyter Notebook. Crie um arquivo 'app.ipynb' e insira duas células essenciais. Na primeira, defina 'persons' com 'get_persons', calcule o IMC e determine o status. Na segunda, use um loop para concatenar, enviar e exibir dados, destacando a importância da organização.","moduleNumber":3,"chapterNumber":5,"lessonNumber":3,"file":"vd3_403.mp4","footer":"Agora é com você! Carregue o VS Code e pratique essa aula.","youtube_id":"9kiylceqAys","youtube_title":"[Curso Python 3.5.3] Projeto Estruturado com Jupyter Notebook","video_contents":"Agora nós vamos estruturar um projeto utilizando Jupyter Notebook. Comece criando um arquivo app.ipynb e insira duas células essenciais. Na primeira, defina uma variável 'persons' e utilize a função 'get_persons' para obter dados. Calcule o IMC e determine o status. Na segunda célula, crie um loop dividido em três etapas: concatene dados com 'prep_content', envie com 'submit', e exiba os resultados com 'print'. Embora os resultados sejam os mesmos, a organização do projeto é aprimorada, demonstrando o poder de uma boa estruturação em Python."},{"id":16296,"chapterId":75139,"title":"Análise da Estrutura dos Arquivos no Projeto","description":"Vamos analisar a estrutura dos arquivos do projeto Python, focando em três principais. No `app.py`, observe como o código principal está estruturado e documentado. Em `ai.py`, concentram-se as funções de IA, enquanto `data.py` gere dados modularmente, permitindo modificações seguras.","moduleNumber":3,"chapterNumber":5,"lessonNumber":4,"file":"vd3_404.mp4","footer":null,"youtube_id":"5doefHf8M8g","youtube_title":"[Curso Python 3.5.4] Análise da Estrutura dos Arquivos no Projeto","video_contents":"Vamos analisar a estrutura dos arquivos do projeto Python. Essa aula é sobre a organização de códigos através de três arquivos principais. No arquivo `app.py`, vamos ver como o código principal está estruturado de forma clara e bem documentada. Em seguida, exploraremos o `ai.py`, que concentra as funções de inteligência artificial, facilitando alterações futuras. Por fim, no `data.py`, entenda como o gerenciamento de dados é feito de forma modular. Essa abordagem permite modificações localizadas, mantendo o restante do código seguro e estável."},{"id":41304,"chapterId":13258,"title":"Introdução ao Módulo do Streamlit","description":"Vamos explorar o início do Módulo 4, focando na biblioteca Streamlit. Descubra como essa ferramenta transforma a criação de aplicativos em Python, permitindo desenvolver interfaces interativas e amigáveis. Prepare-se para conhecer suas funcionalidades básicas e começar a construir seus próprios projetos.","moduleNumber":4,"chapterNumber":1,"lessonNumber":1,"file":"vd4_001.mp4","footer":null,"youtube_id":"bSx6KFGzws0","youtube_title":"[Curso Python 4.1.1] Introdução ao Módulo do Streamlit","video_contents":"Abertura do módulo 4. Apresentação da bibloteca \"Streamlit\" para o desenvolvimento de aplicativos em Python."},{"id":91468,"chapterId":13258,"title":"Instalando e testando o Streamlit","description":"Vamos instalar o Streamlit utilizando o comando 'pip install'. Em seguida, testaremos sua configuração inicial com 'streamlit hello'. Por fim, exploraremos o playground do Streamlit para entender suas funcionalidades básicas.","moduleNumber":4,"chapterNumber":1,"lessonNumber":2,"file":"vd4_002.mp4","footer":null,"youtube_id":"vpNMQhpGleA","youtube_title":"[Curso Python 4.1.2] Instalando e testando o Streamlit","video_contents":"Instalando o Streamlit com o comando \"pip install\". Testando o Streamlit com o comando \"streamlit hello\". Navegando no playground do streamlit."},{"id":52601,"chapterId":75570,"title":"Rodando o primeiro app","description":"Nesta aula, você irá executar seu primeiro aplicativo com o comando 'streamlit run'. Após isso, faremos alterações no código e aprenderemos a rodá-lo novamente para ver as mudanças em ação. É uma introdução prática ao uso do Streamlit para desenvolvimento ágil de apps.","moduleNumber":4,"chapterNumber":2,"lessonNumber":1,"file":"vd4_101.mp4","footer":"Agora é com você! Carregue o VS Code e pratique essa aula.","youtube_id":"VsevblDATu4","youtube_title":"[Curso Python 4.2.1] Rodando o primeiro app","video_contents":"Rodando o primeiro app com o comando \"streamlit run\". Alterando o código e rodando novamente."},{"id":21549,"chapterId":75570,"title":"Exibindo informações na tela","description":"Vamos explorar como o Streamlit exibe informações na tela, adotando uma abordagem de escrita de cima para baixo. Iremos aprender a criar colunas em cada linha para organizar melhor os dados apresentados, otimizando a visualização em nossos projetos.","moduleNumber":4,"chapterNumber":2,"lessonNumber":2,"file":"vd4_102.mp4","footer":"Agora é com você! Carregue o VS Code e pratique essa aula.","youtube_id":"BGvMU2fysFU","youtube_title":"[Curso Python 4.2.2] Exibindo informações na tela","video_contents":"Como o Streamlit apresenta informações na tela. A escrita de cima para baixo. Criando colunas em cada linha."},{"id":53658,"chapterId":75570,"title":"Comandos para exibição de dados","description":"Essa aula é dedicada a explorar comandos essenciais no Streamlit para exibir dados de forma eficaz. Vamos aprender sobre title, header, subheader, caption, divider e metric. Compreenda como cada elemento contribui para a clareza e apresentação de seu aplicativo.","moduleNumber":4,"chapterNumber":2,"lessonNumber":3,"file":"vd4_103.mp4","footer":"Agora é com você! Carregue o VS Code e pratique essa aula.","youtube_id":"xhZUTG-t-D4","youtube_title":"[Curso Python 4.2.3] Comandos para exibição de dados","video_contents":"Comandos para exibição de dados no streamlit: title, header, subheader, caption, divider e metric."},{"id":97389,"chapterId":75570,"title":"Comandos para entrada de dados","description":"Vamos explorar os comandos de entrada de dados no Streamlit. Você irá aprender a utilizar text_input para textos, number_input para números, date_input para datas e text_area para textos longos. Essa aula é essencial para criar formulários interativos em suas aplicações.","moduleNumber":4,"chapterNumber":2,"lessonNumber":4,"file":"vd4_104.mp4","footer":"Agora é com você! Carregue o VS Code e pratique essa aula.","youtube_id":"ah-hvMq5-Ic","youtube_title":"[Curso Python 4.2.4] Comandos para entrada de dados","video_contents":"Comandos para entrada de dados no streamlit: text_input, number_input, date_input e text_area."},{"id":61954,"chapterId":75570,"title":"Usando o Pandas com o Streamlit","description":"Vamos explorar o uso do Pandas com o Streamlit, aprendendo a abrir arquivos Excel e exibindo dataframes com comandos mágicos. Além disso, você irá utilizar o selectbox do Streamlit para interagir com seus dados de forma dinâmica e eficiente.","moduleNumber":4,"chapterNumber":2,"lessonNumber":5,"file":"vd4_105.mp4","footer":"Agora é com você! Carregue o VS Code e pratique essa aula.","youtube_id":"OW-_kJuTJmM","youtube_title":"[Curso Python 4.2.5] Usando o Pandas com o Streamlit","video_contents":"Uso do Pandas, abrindo arquivos excel, comando mágico para exibir dataframe, uso com o selectbox."},{"id":31761,"chapterId":68988,"title":"Preparando a estrutura do aplicativo","description":"Iremos abordar a organização do aplicativo, dividindo o código em múltiplos arquivos. Aprenda a criar a pasta 'functions' para armazenar e importar funções de maneira eficiente, facilitando a manutenção e a escalabilidade do seu projeto.","moduleNumber":4,"chapterNumber":3,"lessonNumber":1,"file":"vd4_201.mp4","footer":"Agora é com você! Carregue o VS Code e pratique essa aula.","youtube_id":"HWDSpYY5g7c","youtube_title":"[Curso Python 4.3.1] Preparando a estrutura do aplicativo","video_contents":"Divisão do código em arquivos. Criação da pasta functions para os arquivos que serão importados."},{"id":69628,"chapterId":68988,"title":"Montando o arquivo da IA","description":"Nessa aula, vamos configurar o arquivo ai.py. Ele será responsável por implementar funções de inteligência artificial e estabelecer a conexão necessária com a API da OpenAI. Preparar este arquivo de forma adequada é essencial para o funcionamento correto do projeto.","moduleNumber":4,"chapterNumber":3,"lessonNumber":2,"file":"vd4_202.mp4","footer":"Agora é com você! Carregue o VS Code e pratique essa aula.","youtube_id":"_Ktjknt98JU","youtube_title":"[Curso Python 4.3.2] Montando o arquivo da IA","video_contents":"Preparação do arquivo ai.py. Ele terá as funções de inteligência artificial e a conexão com a api da OpenAI."},{"id":22067,"chapterId":68988,"title":"Montando o arquivo dos cálculos","description":"Agora nós vamos preparar o arquivo calcs.py. Ele será responsável por calcular o Índice de Massa Corporal (IMC) e determinar o status correspondente. Além disso, incluirá funções para calcular a idade a partir da data de nascimento e converter idade em ano de nascimento, trazendo praticidade.","moduleNumber":4,"chapterNumber":3,"lessonNumber":3,"file":"vd4_203.mp4","footer":"Agora é com você! Carregue o VS Code e pratique essa aula.","youtube_id":"Z3pI-ZUnHYs","youtube_title":"[Curso Python 4.3.3] Montando o arquivo dos cálculos","video_contents":"Preparação do arquivo calcs.py. Ele calcula o IMC e o status. Também calcula a idade a partir do nascimento e vice-versa."},{"id":70304,"chapterId":68988,"title":"Montando o arquivo do dataframe","description":"Nessa aula, vamos montar o arquivo df.py para manipulação de dataframes. Você aprenderá a conectar-se à planilha \"profiles\" usando pandas, extrair uma lista de nomes e recuperar dados específicos de um perfil selecionado. Isso facilitará a análise e manipulação de dados no seu projeto.","moduleNumber":4,"chapterNumber":3,"lessonNumber":4,"file":"vd4_204.mp4","footer":"Agora é com você! Carregue o VS Code e pratique essa aula.","youtube_id":"senuoKqiGSI","youtube_title":"[Curso Python 4.3.4] Montando o arquivo do dataframe","video_contents":"Preparação do arquivo df.py. Ele faz a conexão com a planilha \"profiles\" usando o pandas. Devolve uma lista de nomes e também recupera os dados da pessoa selecionada."},{"id":60339,"chapterId":25318,"title":"Iniciando o código principal","description":"Nessa aula, iremos elaborar o arquivo inicial app.py, aprendendo a importar pacotes e funções essenciais. Vamos também explorar a criação do cabeçalho, estabelecendo a base para o desenvolvimento do seu projeto em Python.","moduleNumber":4,"chapterNumber":4,"lessonNumber":1,"file":"vd4_301.mp4","footer":"Agora é com você! Carregue o VS Code e pratique essa aula.","youtube_id":"o7lUlAsRGT8","youtube_title":"[Curso Python 4.4.1] Iniciando o código principal","video_contents":"Elaboração inicial do arquivo app.py. Importando pacotes e funções. Elaboração do cabeçalho."},{"id":42548,"chapterId":25318,"title":"Selecionando a pessoa","description":"Iremos explorar a função 'selectbox' do Streamlit para criar interfaces interativas. Também utilizaremos funções personalizadas do dataframe, desenvolvidas no arquivo df.py, para manipular e exibir dados de forma dinâmica e eficiente.","moduleNumber":4,"chapterNumber":4,"lessonNumber":2,"file":"vd4_302.mp4","footer":"Agora é com você! Carregue o VS Code e pratique essa aula.","youtube_id":"55Cj2rt0qt4","youtube_title":"[Curso Python 4.4.2] Selecionando a pessoa","video_contents":"Função \"selectbox\" do streamlit. Uso das funções do dataframe criadas no arquivo df.py."},{"id":94957,"chapterId":25318,"title":"Input de dados e botão \"Enviar\"","description":"Nessa aula, exploraremos caixas de input, incluindo 'text_input', 'number_input', 'date_input' e 'text_area'. Aprenderemos a criar um botão de 'Enviar' usando 'button'. Integrar as funções das bibliotecas 'calcs.py' e 'ai.py' faz parte deste aprendizado prático e essencial.","moduleNumber":4,"chapterNumber":4,"lessonNumber":3,"file":"vd4_303.mp4","footer":"Agora é com você! Carregue o VS Code e pratique essa aula.","youtube_id":"fYHFYZZ_PiM","youtube_title":"[Curso Python 4.4.3] Input de dados e botão \"Enviar\"","video_contents":"Caixas de input de dados com \"text_input\", \"number_input\", \"date_input\" e \"text_area\". Botão de enviar com \"button\". Uso das funções \"calcs.py\" e \"ai.py\"."},{"id":90337,"chapterId":25318,"title":"Submetendo à IA e fazendo o processamento","description":"Iremos explorar a função 'spinner' do Streamlit para otimizar a experiência do usuário durante o processamento. Também aprenderemos a submeter dados à IA e utilizaremos a função do arquivo 'ai.py' para realizar operações específicas. Essa aula é essencial para integrar IA em suas aplicações.","moduleNumber":4,"chapterNumber":4,"lessonNumber":4,"file":"vd4_304.mp4","footer":"Agora é com você! Carregue o VS Code e pratique essa aula.","youtube_id":"qjjinJHzvH0","youtube_title":"[Curso Python 4.4.4] Submetendo à IA e fazendo o processamento","video_contents":"Função \"spinner\" do streamlit. Submentendo os dados à IA. Uso da função do arquivo \"ai.py\"."},{"id":84924,"chapterId":25318,"title":"Digitando uma pessoa nova","description":"Vamos aprender a inserir dados manualmente de uma nova pessoa, garantindo a correção de erros comuns. Concluiremos com a integração dos dados na aplicação, assegurando um funcionamento adequado e preciso. Essa aula fornece as habilidades necessárias para a entrada eficaz de informações.","moduleNumber":4,"chapterNumber":4,"lessonNumber":5,"file":"vd4_305.mp4","footer":"Agora é com você! Carregue o VS Code e pratique essa aula.","youtube_id":"4JQL7szG7aU","youtube_title":"[Curso Python 4.4.5] Digitando uma pessoa nova","video_contents":"Dados inseridos manualmente. Correção de erros. Conclusão da aplicação."},{"id":70426,"chapterId":96085,"title":"Deploy da aplicação no Streamlit Community","description":"Essa aula é sobre o processo de deploy de uma aplicação no Streamlit Community. Iremos explorar as três fases principais: como usar o VS Code para desenvolvimento, integrar e versionar o código com o GitHub, e finalmente, realizar o deploy na plataforma do Streamlit Community.","moduleNumber":4,"chapterNumber":5,"lessonNumber":1,"file":"vd4_401.mp4","footer":null,"youtube_id":"JpDBRYBWM1o","youtube_title":"[Curso Python 4.5.1] Deploy da aplicação no Streamlit Community","video_contents":"Explicação geral do processo de deploy da aplicação no Streamit Community. As três fases: VS Code, Github e Streamlit Community."},{"id":77299,"chapterId":96085,"title":"Ajustando o código e ocultando a chave da API","description":"Nesta aula, abordaremos como criar o arquivo 'requirements.txt' e configurar a pasta '.streamlit' com 'secrets.toml'. Faremos ajustes no arquivo 'ai.py', além de instruir sobre a remoção da pasta '__pycache__'. Essas práticas ajudam a manter seu projeto seguro e organizado.","moduleNumber":4,"chapterNumber":5,"lessonNumber":2,"file":"vd4_402.mp4","footer":"Agora é com você! Carregue o VS Code e pratique essa aula.","youtube_id":"S--yBsscIOE","youtube_title":"[Curso Python 4.5.2] Ajustando o código e ocultando a chave da API","video_contents":"Criando o arquivo \"requirements.txt\". A pasta \".streamlit\" com o arquivo \"secrets.toml\". Alterando o arquivo \"ai.py\". Apagando a pasta \"py_cache\"."},{"id":27315,"chapterId":96085,"title":"Github: criação da conta e upload dos códigos","description":"Nessa aula, mergulharemos no universo do GitHub. Vamos criar uma conta, estabelecer nosso primeiro repositório e aprender a fazer upload de arquivos. Passo a passo, você dominará as etapas essenciais para começar a usar essa poderosa ferramenta de versionamento.","moduleNumber":4,"chapterNumber":5,"lessonNumber":3,"file":"vd4_403.mp4","footer":"Agora é com você. Crie a sua conta no Github e suba seus arquivos.","youtube_id":"xAbhkBswRDM","youtube_title":"[Curso Python 4.5.3] Github: criação da conta e upload dos códigos","video_contents":"Criando conta no Github. Criando repositório. Fazendo upload de arquivos."},{"id":19257,"chapterId":96085,"title":"Publicando no Streamlit Community Cloud","description":"Essa aula é sobre como publicar no Streamlit Community Cloud. Vamos conectar sua conta com o GitHub, criar um app e passar a API Key nos advanced settings. Por fim, faremos o deploy, garantindo que sua aplicação esteja acessível online.","moduleNumber":4,"chapterNumber":5,"lessonNumber":4,"file":"vd4_404.mp4","footer":"Agora é com você. Publique seu app no Streamlit Community Cloud.","youtube_id":"x6GMHpJWqng","youtube_title":"[Curso Python 4.5.4] Publicando no Streamlit Community Cloud","video_contents":"Conectando sua conta do Streamlit Community Cloud com o Github. Criando um app. Passando a API Key nos advanced settings. Fazendo o deploy."},{"id":27827,"chapterId":96085,"title":"Limitações do Streamlit Community Cloud","description":"Vamos explorar as limitações do Streamlit Community Cloud. Abordaremos como aplicativos sem uso podem adormecer, o impacto de servidores compartilhados na velocidade e as questões de privacidade sem garantias. Essa compreensão é crucial para otimizar o uso da plataforma.","moduleNumber":4,"chapterNumber":5,"lessonNumber":5,"file":"vd4_405.mp4","footer":null,"youtube_id":"zH50gqvzBZk","youtube_title":"[Curso Python 4.5.5] Limitações do Streamlit Community Cloud","video_contents":"Limitações do Streamlit Community Cloud: aplicativo sem uso adormece, servidor compartilhado pode ser lento e não há garantia de privacidade."},{"id":82938,"chapterId":96085,"title":"Serviços pagos para deploy e encerramento","description":"Essa aula é dedicada a explorar alternativas pagas para publicar aplicativos do Streamlit, como Ploomber e serviços de containers. Iremos discutir como essas soluções podem facilitar o deploy profissional. Além disso, faremos o encerramento do curso com uma revisão final.","moduleNumber":4,"chapterNumber":5,"lessonNumber":6,"file":"vd4_406.mp4","footer":null,"youtube_id":"Pyg_3-rFG3I","youtube_title":"[Curso Python 4.5.6] Serviços pagos para deploy e encerramento","video_contents":"Alternativas pagas para publicar aplicativos do Streamlit. Ploomber e serviços de containers. Encerramento do curso."}]